Enums/ОснованияПрекращенияПособийПоУходу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ОснованияПрекращенияПособийПоУходу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриказОДосрочномВыходеНаРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриказОбУвольнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвидетельствоОСмертиРебенка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрекращениеОснованийДляВыплатыПособия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнойПриказИлиДокумент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ОснованияПрекращенияПособийПоУходу/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ЗначениеЧислом(Значение) Экспорт
	// Признак типа приказа страхователя/документа:
	Если Значение = ПриказОДосрочномВыходеНаРаботу Тогда
		Возврат 1; // О преждевременном выходе на работу.
	ИначеЕсли Значение = ПриказОбУвольнении Тогда
		Возврат 2; // О прекращении трудовых отношений.
	ИначеЕсли Значение = СвидетельствоОСмертиРебенка Тогда
		Возврат 3; // О смерти ребенка.
	ИначеЕсли Значение = ПрекращениеОснованийДляВыплатыПособия Тогда
		Возврат 4; // О прекращение оснований для выплаты пособия.
	ИначеЕсли Значение = ИнойПриказИлиДокумент Тогда
		Возврат 5; // Иное.
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецЕсли
